Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarMovedBarsOverlapped
There are identical overlapping bars in the rebar set. This will result in double counting in schedules.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarInvalidDiameterRemoved
Invalid RebarBarType was removed on upgrade.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarHookOverEndTreatment
Cannot set hook at an end that has end treatment.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarEndTreatmentOverHook
Cannot set end treatment at an end that has hook.

Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarDimensionalConstraintLost
Dimensional constraint on Rebar element was lost on upgrade.